# taps
tap "busterc/tap"
tap "heroku/brew"
tap "homebrew/cask-fonts"
tap "petere/postgresql"
tap "homebrew/cask-versions"
tap "ruchirchawdhry/casks"
tap "romkatv/powerlevel10k"


brew "openssh"
brew "ssh-copy-id"
brew "stow"
brew "curl"
brew "wget"

# gnu
brew "gnu-which"
brew "gbu-tar"
brew "coreutils"

# shells
brew "bash"
brew "bash-git-prompt"
brew "bash-snippets"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"

# langs
brew "python"
brew "golang"

# utils
brew "htop"
brew "ncdu"
brew "duc"
brew "fzf"
brew "grep"
brew "ripgrep"
brew "blueutil"
brew "goto"
brew "cash-cli"
brew "hardlink-osx"
brew "osx-iso"

# dev
brew "git"
brew "git-lfs"
brew "git-standup"
brew "git-ssh"
brew "git-secrets"
brew "gitleaks"
brew "git-quick-stats"
brew "github-markdown-toc"
brew "lazygit"
brew "jq"
brew "tldr"
brew "tmux"
brew "sqlite"
brew "termrec"
brew "ttygif"
brew "asciinema"
brew "create-dmg"
brew "gist"
brew "brew-gem"
brew "gibo"
brew "pgcli"
brew "mycli"
brew "isocodes"

# images
brew "imagemagick"
brew "vips"
brew "imageoptim-cli"
brew "exiftool"
brew "gifski"
brew "gifify"
brew "gifsicle"
brew "gif2png"
brew "gifcap"
brew "imagejs"
brew "instalooter"
brew "imagesnap"

# video
brew "ffmpeg"
brew "youtube-dl"
brew "x264"
brew "x265"
brew "libde265"
brew "libvpx"
brew "vcs"
brew "theora"
brew "libdv"
brew "xvid"
brew "media-info"
brew "libmatroska"
brew "mkvtoolnix"
brew "get_iplayer"

# audio
brew "opus"
brew "flac"
brew "libvorbis"
brew "vorbis-tools"
brew "audiofile"
brew "codec2"
brew "speex"
brew "fdk-aac"
brew "mp3fs"
brew "two-lame"
brew "switchaudio-osx"
brew "alac"
brew "bpm-tools"
brew "lame"
brew "midicsv"
brew "normalize"
brew "portaudio"
brew "mkvdts2ac3"
brew "libsamplerate"
brew "flac123"
brew "herrie"
brew "easy-tag"
brew "wavpack"
brew "taglib"
brew "libao"
brew "mad"
brew "flake"
brew "faac"
brew "opencore-amr"



# disc
brew "libdvdnav"
brew "libdvdread"
brew "libdvdcss"
brew "cdlabelgen"
brew "dvdbackup"
brew "dvd+rw-tools"
brew "dvdauthor"
brew "dvd-vr"
brew "lsdvd"
brew "gaffitter"
brew "paranoia"

# backup & sync
brew "dar"
brew "syncthing"
brew "rdup"
brew "timedog"
brew "imapsync"
brew "duplicity"
brew "duplicati"
brew "duply"
brew "restic"
brew "bup"
brew "mackup"
brew "rdiff-backup"

# crypto
brew "snow"

